package kr.co.dothome.qandi.chapter04;

public class Chapter0401 {
	public static void main(String[] args) {
		/*----------------------------------------------------------------------------------------
		 * 	Chapter04-01	데이터 타입 분류
		 * 
		 * 	자바의 데이터 타입에는 크게 기본타입(원시 타입:primitive type)과 참조 타입(reference type)으로 분류
		 * 
		 * 	기본 타입이란 정수, 실수, 문자, 논리 리터럴을 저장하는 타입
		 * 	ex) 정수 타입 : byte, char, short, int, long
		 * 		실수 타입 : float, double
		 * 		논리 타입 : boolean
		 * 	참조 타입이란 객체(Object)의 번지를 참조하는 타입으로 배열, 열거 , 인터페이스 타입을 말한다.
		 * 
		 * 	기본타입으로 선언된 변수와 참조타입으로 선언된 변수의 차이:
		 * 	- 기본타입인 byte, char, short, int, long, float, double, boolean을 이용해서 선언된 변수는 실제값을 변수안에 저장
		 * 	- 참조타입인 배열, 열거, 클래스, 인터페이스를 이용해서 선언된 변수는 메모리의 번지 값으로 저장. 
		 *    번지를 통해 객체를 참조한다는 뜻에서 참조타입이라 부름
		 *    
		 *	변수는 스택영역에생성, 객체는 힙영역에생성
		 *	참조타입은 힙영역의 주소값을 참조한다.
		 ----------------------------------------------------------------------------------------*/
	}
}
